/*********************************************************************************************/
/*                    response_struct.h Created by xuli on 2017/08/15                        */
/*                        本文件实现响应结构体的内存分配以及释放                             */
/*********************************************************************************************/
#ifndef __RESPONSE_STRUCT_H__
#define __RESPONSE_STRUCT_H__

#include "types.pb-c.h"
#include <stdlib.h>


/**************************************************************************
 * 给响应Echo结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseEcho *response_malloc_echo();


/**************************************************************************
 * 给响应Flush结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseFlush *response_malloc_flush();


/**************************************************************************
 * 给响应Info结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseInfo *response_malloc_info();


/**************************************************************************
 * 给响应SetOption结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseSetOption *response_malloc_setoption();


/**************************************************************************
 * 给响应DeliverTx结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseDeliverTx *response_malloc_delivertx();


/**************************************************************************
 * 给响应CheckTx结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseCheckTx *response_malloc_checktx();


/**************************************************************************
 * 给响应Commit结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseCommit *response_malloc_commit();


/**************************************************************************
 * 给响应Query结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseQuery *response_malloc_query();


/**************************************************************************
 * 给响应InitChain结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseInitChain *response_malloc_initchain();


/**************************************************************************
 * 给响应BeginBlock结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseBeginBlock *response_malloc_beginblock();


/**************************************************************************
 * 给响应EndBlock结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseEndBlock *response_malloc_endblock();

/**************************************************************************
 * 给响应Exception结构体分配内存
 * @return:成功返回分配的内存的地址，失败返回NULL
**************************************************************************/
Types__ResponseException *response_malloc_exception();


/**************************************************************************
 * 释放响应Echo结构体内存
 * @echo:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_echo(Types__ResponseEcho *echo);


/**************************************************************************
 * 释放响应Flush结构体内存
 * @flush:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_flush(Types__ResponseFlush *flush);


/**************************************************************************
 * 释放响应Info结构体内存
 * @Info:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_info(Types__ResponseInfo *info);


/**************************************************************************
 * 释放响应SetOption结构体内存
 * @setoption:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_setoption(Types__ResponseSetOption *setoption);;


/**************************************************************************
 * 释放响应DeliverTx结构体内存
 * @delivertx:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_delivertx(Types__ResponseDeliverTx *delivertx);


/**************************************************************************
 * 释放响应CheckTx结构体内存
 * @checktx:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_checktx(Types__ResponseCheckTx *checktx);


/**************************************************************************
 * 释放响应Commit结构体内存
 * @commit:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_commit(Types__ResponseCommit *commit);


/**************************************************************************
 * 释放响应Query结构体内存
 * @query:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_query(Types__ResponseQuery *query);


/**************************************************************************
 * 释放响应InitChain结构体内存
 * @initchain:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_initchain(Types__ResponseInitChain *initchain);


/**************************************************************************
 * 释放响应BeginBlock结构体内存
 * @beginblock:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_beginblock(Types__ResponseBeginBlock *beginblock);


/**************************************************************************
 * 释放响应EndBlock结构体内存
 * @endblock:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_endblock(Types__ResponseEndBlock *endblock);


/**************************************************************************
 * 释放响应Exception结构体内存
 * @exception:待释放的结构体
 * @return:返回空值
 **************************************************************************/
void response_free_exception(Types__ResponseException *exception);

#endif
