/*********************************************************************************************/
/*                   internal.h Created by xuli on 2017/08/28                                */
/*                      本文件提供的接口仅供C-ABCI内部使用                                   */
/*********************************************************************************************/
#ifndef __INTERNAL_H__
#define __INTERNAL_H__

#include "bits.h"
#include "bigEndian.h"
#include "socket_tcp.h"
#include "socket_io.h"
#include "message.h"
#include "response_struct.h"

#define POLLTIMEOUT  5000   /* 等待描述符有新动作的超时时间 单位:ms */
#define READTIMEOUT  1000   /* 接收数据默认的超时时间       单位:ms */
#define SENDTIMEOUT  1000   /* 发送数据默认的超时时间       单位:ms */

typedef void* (*Application)(Types__Request *);

/************************************************************************************************
 * 读取待接收的数据长度
 * @tsocket:待读取数据的套接字
 * @timeout:读取长度的超时时间设置
 * @return: 成功返回读取到的数据长度，失败返回-1，错误保存在tsocket->error中
 ************************************************************************************************/
size_t readsize(struct socket_tcp *tsocket, int timeout);


/************************************************************************************************
 * 发送待发送的数据长度
 * @tsocket:待发送数据的套接字
 * @length: 待发送的长度值
 * @timeout:发送长度的超时时间设置
 * @return: 成功返回0， 失败返回-1
 ************************************************************************************************/
size_t sendsize(struct socket_tcp *tsocket, size_t length, int timeout);


/************************************************************************************************
 * 处理接收到的新连接
 * @tsocket:新连接的套接字
 * @app:应用程序提供的回调函数，新连接产生请求之后就会回调此函数
 * @return:当对端关闭连接或者出错才会返回，否则一直循环等到接收新连接的请求并给出响应
 ************************************************************************************************/
int dispose_connect(struct socket_tcp *tsocket, Application app);

#endif
