/*********************************************************************************************/
/*                   socket_io.h Created by xuli on 2017/06/10                               */
/*                   注:本文件接口用于tcp socket套接子的读写                                 */
/*********************************************************************************************/

#ifndef __SOCKET_IO_H__
#define __SOCKET_IO_H__

#include "socket.h"

/************************************************************************************************
 * 从socket的IO口读取数据
 * @tsocket:待读取数据的socket
 * @buff:输出参数，存放读取的数据
 * @len:待读取数据的长度
 * @timeout:超时设置，=-1 一直阻塞接收数据 =0不阻塞接收数据 >0设置超时接收数据 [单位:ms]
 * @return: >0 返回读取的字节数 =0对端已关闭socket  =-1读取数据出错(错误码存放在tsocket->error)
 ************************************************************************************************/
int socket_read(struct tcp_socket *tsocket, char *buff, int len, int timeout);




/************************************************************************************************
 * 往socket的IO口发送数据
 * @tsocket:待发送数据的socket
 * @buff:输入参数，待发送的数据
 * @len:待发送数据的长度
 * @timeout:超时设置，=-1一直阻塞发送数据 =0不阻塞发送数据 >0设置超时发送数据 [单位:ms]
 * @return: 成功返回发送的字节数，失败返回-1(错误码存放在tsocket->error)
 ************************************************************************************************/
int socket_send(struct tcp_socket *tsocket, const char *buff, int len, int timeout);

#endif
